DELETE FROM Doc_type;
DELETE FROM Country;
DELETE FROM Organization;
DELETE FROM Office;
DELETE FROM Document;
DELETE FROM User;

ALTER TABLE Doc_type ALTER COLUMN id RESTART WITH 10000;
ALTER TABLE Country ALTER COLUMN id RESTART WITH 10000;
ALTER TABLE Organization ALTER COLUMN id RESTART WITH 10000;
ALTER TABLE Office ALTER COLUMN id RESTART WITH 10000;
ALTER TABLE Document ALTER COLUMN id RESTART WITH 10000;
ALTER TABLE User ALTER COLUMN id RESTART WITH 10000;

INSERT INTO Doc_type (code, name)
VALUES
       ('03', 'Свидетельство о рождении'), --10000
       ('07', 'Военный билет'),
       ('08', 'Временное удостоверение, выданное взамен военного билета'),
       ('10', 'Паспорт иностранного гражданина'),
       ('11', 'Св-во о рассмотрении ходатайства о признании лица беженцем на территории РФ по существу'),
       ('12', 'Вид на жительство в Российской Федерации'),
       ('13', 'Удостоверение беженца'),
       ('15', 'Разрешение на временное проживание в Российской Федерации'),
       ('18', 'Свидетельство о предоставлении временного убежища на территории Российской Федерации'),
       ('21', 'Паспорт гражданина Российской Федерации'), --10009
       ('23', 'Свидетельство о рождении, выданное уполномоченным органом иностранного государства'),
       ('24', 'Удостоверение личности военнослужащего Российской Федерации'),
       ('91', 'Иные документы');
	
--Взято из общероссийского классификатора стран мира (в ред. от 01.08.2018
INSERT INTO Country (code, name)
VALUES
       ('643', 'Российская Федерация'), --10000
       ('112', 'Республика Беларусь'),
       ('398', 'Республика Казахстан'),
       ('804', 'Украина'),
       ('417', 'Киргизская Республика'),
       ('156', 'Китайская Народная Республика'),
       ('428', 'Латвийская Республика'),
       ('440', 'Литовская Республика'),
       ('642', 'Румыния'),
       ('616', 'Республика Польша'),
       ('620', 'Португальская Республика');

INSERT INTO Organization (name, full_name, inn, kpp, address, phone, is_active)
VALUES
       ('ООО Азбука', --10000
        'Общество с ограниченной ответственностью Азбука',
        '7720123456',
        '772001001',
        'г. Москва, Зеленый просп, 10',
        '4951234567',
        TRUE),
       ('ООО Букварь', --10001
        'Общество с ограниченной ответственностью Букварь',
        '7720123457',
        '772001001',
        'г. Москва, Кусковая ул, 17',
        '4951234568',
        TRUE),
       ('АО Велес', --10002
        'Акционерное общество Велес',
        '7714123456',
        '771401001',
        'г. Москва, Беговой пр-д, 8',
        '4951234568',
        TRUE),
       ('ООО Домовой', --10003
        'Общество с ограниченной ответственностью Домовой',
        '7714123457',
        '771401001',
        'г. Москва, Ленинградский просп., 31А, стр. 1',
        '4951234569',
        TRUE);

INSERT INTO Office (name, address, phone, is_active, organization_id)
VALUES
       --10000
       ('Главный офис',
        'г. Москва, Зеленый просп, 10',
        '4951234567',
        TRUE,
        10000),
       --10001
       ('Офис на Варшавском шоссе',
        'г. Москва, Варшавское шоссе, 141',
        '4951231122',
        TRUE,
        10000),
       --10002
       ('Офис на Ленинградском проспекте',
        'г. Москва, Ленинградский просп, 9',
        '4951231133',
        TRUE,
        10000),
       --10003
       ('Головной офис',
        'г. Москва, Кусковая ул, 17',
        '4951234568',
        TRUE,
        10001),
       --10004
       ('Центральный офис',
        'г. Москва, Беговой пр-д, 8',
        '4951234568',
        TRUE,
        10002),
       --10005
       ('Домовой на Ленинградке',
        'г. Москва, Ленинградский просп., 31А, стр. 1',
        '4951234569',
        TRUE,
        10003);
	
INSERT INTO Document (doc_type_id, doc_number, issue_date)
VALUES
       (10009, '7701123123', DATE '2000-01-31'), --10000
       (10009, '7701123456', DATE '2000-02-01'), --10001
       (10009, '7701123111', DATE '2000-02-03'), --10002
       (10009, '7785123321', DATE '2005-02-03'), --10003
       (10009, '7785123333', DATE '2005-02-28'), --10004
       (10009, '7785123344', DATE '2005-03-01'), --10005
       (10009, '7785443344', DATE '2005-10-01'), --10006
       (10009, '6565111222', DATE '1998-02-01'), --10007
       (10009, '3030222333', DATE '2015-12-01'), --10008
       (10009, '2323101010', DATE '2010-10-10'), --10009
       (10009, '2323101101', DATE '2012-12-15'); --10010
	
INSERT INTO User
    (first_name,
     second_name,
     middle_name,
     position,
     phone,
     doc_id,
     country_id,
     is_identified,
     office_id)
VALUES
       ('Антон', --10000
        'Антонов',
        'Антонович',
        'Генеральный директор',
        '9151231123',
        10000,
        10000,
        TRUE,
        10000),
       ('Антонина', --10001
        'Антонова',
        'Антоновна',
        'Главный бухгалтер',
        '9151234567',
        10001,
        10000,
        TRUE,
        10001),
       ('Алексей', --10002
        'Попович',
        'Даниилович',
        'Коммерческий директор',
        '9151231111',
        10002,
        10000,
        TRUE,
        10002),
       ('Александр', --10003
        'Македонский',
        'Александрович',
        'Курьер',
        '9157654321',
        10003,
        10000,
        TRUE,
        10000),
       ('Борис', --10004
        'Борисенко',
        'Борисович',
        'Генеральный директор',
        '9251112233',
        10004,
        10000,
        TRUE,
        10003),
       ('Богдан', --10005
        'Борисенко',
        'Борисович',
        'Заместитель генерального директора',
        '9251112244',
        10005,
        10000,
        TRUE,
        10003),
       ('Белла', --10006
        'Бунина',
        'Борисовна',
        'Коммерческий директор',
        '9251112255',
        10006,
        10000,
        TRUE,
        10003),
       ('Валерий', --10007
        'Леонтьев',
        'Валерьевич',
        'Генеральный директор',
        '9057778899',
        10007,
        10000,
        TRUE,
        10004),
       ('Велемир', --10008
        'Хмарин',
        'Перунович',
        'Менеджер',
        '9030303123',
        10008,
        10000,
        TRUE,
        10004),
       ('Галина', --10009
        'Домовой',
        'Георгиевна',
        'Генеральный директор',
        '9115556677',
        10009,
        10000,
        TRUE,
        10005),
       ('Глеб', --10010
        'Васильев',
        'Васильевич',
        'Продавец-консультант',
        '9138889900',
        10010,
        10000,
        TRUE,
        10005);
